# ConfusingHostByElementsInMainModel Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..ConfusingHostByElementsInMainModel Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
An insert in a design option cannot be hosted by an element in the Main Model [--if you continue it will not be added to the design option set].
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ConfusingHostByElementsInMainModel { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ConfusingHostByElementsInMainModel As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ConfusingHostByElementsInMainModel {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace